Repository: pseymour/MakeMeAdmin
Catalog: UserList/MultilingualResources/UserList.*.xlf
Languages: fr_ca

# RemovalReasonServiceStopped
source: Make Me Admin service stopped
fr_ca: Service Make Me Admin arrêté

# RemovalReasonTimeout
source: Timeout elapsed
fr_ca: Délai d'attente écoulé

# RemovalReasonUnknown
source: Unknown
fr_ca: Inconnu

# RemovalReasonUserLogoff
source: User logged off
fr_ca: Utilisateur déconnecté

# RemovalReasonUserRequest
source: User requested removal
fr_ca: Suppression demandée par l'utilisateur

# AddingUserReturnedError
source: Adding user {0} ({1}) to the Administrators group returned error code {2}.
fr_ca: L'ajout de l'utilisateur {0} ({1}) au groupe Administrateurs a généré une erreur avec le code {2}.

source: Local admins group SID is null.
fr_ca: Le SID du groupe local Administrateurs est invalide.

source: Local machine context is null.
fr_ca: Le contexte de la machine locale est invalide.

# RemovingUserReturnedError
source: Removing user {0} ({1}) from the Administrators group returned error code {1}.
fr_ca: La suppression de l'utilisateur {0} ({1}) du groupe Administrateurs a généré une erreur avec le code {1}.

source: Unknown Account
fr_ca: Compte Inconnu

# UserAddedToAdminsGroup
source: User {0} ({1}) added to the Administrators group.
fr_ca: L'utilisateur {0} ({1}) a été ajouté au groupe Administrateurs.

# UserRemoved
source: User {0} ({1}) removed from the Administrators group. Reason: {2}.
fr_ca: L'utilisateur {0} ({1}) a été retiré du groupe Administrateurs. Raison: {2}.

# AddingUserBackToAdministrators
source: Adding the user back to the Administrators group.
fr_ca: Rajout de l'utilisateur au groupe Administrateurs.

# RemovingUserFromList
source: Removing the user from Make Me Admin's list.
fr_ca: Suppression de l'utilisateur de la liste de Make Me Admin.

# UserRemovedByOutsideProcess
source: User {0} ({1}) has been removed from the Administrators group by an outside process.
fr_ca: L'utilisateur {0} ({1}) a été retiré du groupe Administrateurs par un processus externe.
