<?xml version="1.0" encoding="utf-8"?>
<policyDefinitions xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                   xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                   xmlns="http://schemas.microsoft.com/GroupPolicy/2006/07/PolicyDefinitions"
                   revision="1.0"
                   schemaVersion="1.0">

	<policyNamespaces>
		<target prefix="scc" namespace="SinclairCC.Policies.SCC" />
	</policyNamespaces>

	<resources minRequiredRevision="1.0" />

	<categories>
		<category name="SinclairRoot" displayName="$(string.SinclairRoot)" explainText="$(string.SinclairRoot_Help)" />
	</categories>

</policyDefinitions>