Repository: pseymour/MakeMeAdmin
Catalog: ProcessCommunication/MultilingualResources/ProcessCommunication.*.xlf
Languages: de, nb

# AddingUserBackToAdministrators
source: Adding the user back to the Administrators group.
de: Füge den Benutzer wieder zur Administratorengruppe hinzu.
nb: Legger brukeren tilbake i Administrator-gruppa

# AddingUserReturnedError
source: Adding user {0} ({1}) to the Administrators group returned error code {2}.
de: Hinzufügen des Benutzers {0} ({1}) zur Administratorengruppe erzeugte Fehlercode {2}.
nb: Ileggelse av bruker {0} ({1}) i Administrator-gruppa returnerte feilkode {2}.

source: Exception
de: Ausnahme

source: Local admins group SID is null.
de: SID der lokalen Administratorengruppe ist null.

source: Local machine context is null.
de: Lokaler Maschinenkontext ist null.

# RemovalReasonServiceStopped
source: Make Me Admin service stopped
de: Make Me Admin Dienst gestoppt

# RemovalReasonTimeout
source: Timeout elapsed
de: Zeitüberschreitung abgelaufen

# RemovalReasonUnknown
source: Unknown
de: Unbekannt
nb: Ukjent

# RemovalReasonUserLogoff
source: User logged off
de: Benutzer abgemeldet
nb: Bruker logget av

# RemovalReasonUserRequest
source: User requested removal
de: Benutzer hat Entfernung angefordert
nb: Bruker forespurte fjerning

# RemovingUserFromList
source: Removing the user from Make Me Admin's list.
de: Entferne den Benutzer aus Make Me Admin's Liste.
nb: Fjerner brukeren fra Make Me Admins liste

# RemovingUserReturnedError
source: Removing user {0} ({1}) from the Administrators group returned error code {1}.
de: Entfernen des Benutzers {0} ({1}) aus der Administratorengruppe erzeugte Fehlercode {1}.
nb: Fjerning av bruker {0} ({1}) fra Administrator-gruppa returnerte feilkode {1}.

# RequestSentFromHost
source: Request was sent from host {0}.
de: Anfrage gesendet von Host {0}.
nb: Forespørsel fra host {0}.

source: Unknown Account
de: Unbekanntes Konto
nb: Ukjent konto

# UserAddedToAdminsGroup
source: User {0} ({1}) added to the Administrators group.
de: Benutzer {0} ({1}) zur Administratorengruppe hinzugefügt.
nb: Bruker {0} ({1}) lagt til i Administrator-gruppa

# UserRemoved
source: User {0} ({1}) removed from the Administrators group. Reason: {2}.
de: Benutzer {0} ({1}) aus Administratorengruppe entfernt. Grund: {2}.
nb: Bruker {0} ({1}) fjernet fra Administrator-gruppa. Grunn: {2}.

# UserRemovedByOutsideProcess
source: User {0} ({1}) has been removed from the Administrators group by an outside process.
de: Benutzer {0} ({1}) wurde durch einen externen Prozess aus der Administratorengruppe entfernt.
nb: Bruker {0} ({1}) ble fjernet fra Administratorer-gruppa av en annen prosess.
